import IMG_2098 from '../media/images/frame-memory/IMG_2098.JPG';
import IMG_2232 from '../media/images/frame-memory/IMG_2232.JPG';
import IMG_2125 from '../media/images/frame-memory/IMG_2125.JPG';
import IMG_2231 from '../media/images/frame-memory/IMG_2231.JPG';
import IMG_2173 from '../media/images/frame-memory/IMG_2173.JPG';

const source = {
  memory: {
    images: [
      { backgroundImage: `URL(${IMG_2098})` },
      { backgroundImage: `URL(${IMG_2232})` },
      { backgroundImage: `URL(${IMG_2125})` },
      { backgroundImage: `URL(${IMG_2231})` },
      { backgroundImage: `URL(${IMG_2173})` }
    ],
    video: [
      {
        video: "../media/videos/frame-memory/bloodstone_v2.mp4",
        image: 'url(../media/videos/frame-memory/poster03_blood_stone_v2.jpg)',
        format: 'popup__video_type_a'
      }
    ],
    texts: {
      rus: [
        '«Лес - это очень важно. Он дает дому тепло и уют, дарит нам чистый воздух, физическое и психическое здоровье, приключения и свободу. В лесу были побеждены римляне, лес служил основой немецкой экономики, под деревьями зародился романтизм 18-ого века, и экологические движения 20-ого века»',
        'Это попытка разговора о войне, о памяти о войне с точки зрения природы. Природа тоже участвует в военных действиях людей в качестве «театра действий», «поля действий», жертвы, порой используется как инструмент поражения (нефть, горящие леса, уничтоженные посадки и тд). А природа помнит, и накапливает «культурный слой» памяти о войне, о сражениях. Люди вводят монументы в память о погибших и восхваляя смелость и героизм павших людей, часто это происходит тоже на природе, но природа упускается как участник и пострадавший от этих действий. Мы хотим показать память, которую хранит земля, деревья. Под таким углом зрения теряется величие человека, павшие воины становятся удобрением для почвы, а цель их борьбы растворяется в просторе ландшафта.',
        'Одно из самых разрушительных и жестоких людских проявлений – это война. И здесь природа в очередной раз оказывается на втором плане. Открытые пространства используют, как «поля битвы», леса и овраги, как укрытие. И если до ХХ века самым страшным военным орудием были огонь и пушки, последние 100 с лишним лет человечество значительно обогатило арсенал взаимного уничтожения ядерным, водородным и химическим оружием. Запоминает ли земля боль и ужас войны? Остаются ли у нее своеобразные антропологические шрамы? Или же ее фантастическая способность к регенерации способна нивелировать прошлое?',
        'Гигантские мечи. В детстве мама рассказывала про атлантов, которые населяли Землю. Не могу отделаться от мысли, что это они оставили свое оружие. Хотя раньше всегда представляла атлантов безоружными.'
      ],
      eng: [
        '"The forest is very important. It gives the house warmth and comfort, gives us clean air, physical and mental health, adventure and freedom. The Romans were defeated in the forest, the forest served as the basis of the German economy, the romanticism of the 18th century was born under the trees, and the environmental movements of the 20th century"',
        'This is an attempt to talk about the war, about the memory of the war from the point of view of nature. Nature also participates in the military actions of people as a "theater of action", "field of action", victims, sometimes used as an instrument of defeat (oil, burning forests, destroyed plantings, etc.). And nature remembers, and accumulates a "cultural layer" of memory about the war, about battles. People introduce monuments in memory of the dead and praising the courage and heroism of the fallen people, often this also happens in nature, but nature is overlooked as a participant and victim of these actions. We want to show the memory that the earth and trees keep. From this angle, the greatness of man is lost, fallen warriors become fertilizer for the soil, and the purpose of their struggle dissolves into the vastness of the landscape.',
        'One of the most destructive and cruel human manifestations is war. And here nature once again finds itself in the background. Open spaces are used as "battlefields", forests and ravines, as a shelter. And if fire and cannons were the most terrible military weapon before the twentieth century, over the past 100 years, humanity has significantly enriched the arsenal of mutual destruction with nuclear, hydrogen and chemical weapons. Does the earth remember the pain and horror of war? Does she still have peculiar anthropological scars? Or is her fantastic ability to regenerate capable of leveling the past?',
        `Giant swords. As a child, my mother told me about the Atlanteans who inhabited the Earth. I can't help thinking that they left their weapons behind. Although I always imagined the Atlanteans unarmed before.`
      ],
      format: 'journals_type_a'
    },
    audioArrey: [
      "../media/audio/frame-memory/14.тихий стрекот.mp3"
    ]
  },
  illusion: {
    images: [
      'url(../media/images/frame-illusion/IMG_2082.JPG',
      'url(../media/images/frame-illusion/IMG_2087.JPG',
      'url(../media/images/frame-illusion/IMG_2162.JPG',
      'url(../media/images/frame-illusion/IMG_2192.JPG',
      'url(../media/images/frame-illusion/IMG_5652.JPG',
      'url(../media/images/frame-illusion/IMG_6998.JPG',
      'url(../media/images/frame-illusion/IMG_7023.JPG'
    ],
    video: [
      {
        video: "../media/videos/frame-illusion/flower 2.mp4",
        image: 'url(../media/videos/frame-illusion/poster_flower2.jpg)',
        format: 'popup__video_type_b'
      }
    ],
    texts: {
      rus: [
        `Основные чувства и эмоции - обман зрения, иллюзия присутствия. В конце поездки нас подвозил человек, который в свое время участвовал в строительстве монумента Дидгори и он рассказал нам, что на самом деле битва была в каком-то совершенно другом месте. На территории, определенной под монумент не было найдено ни человеческих останков, ни оружия, ничего.`,
        `Доверившись картам google, мы смело устремились к водопаду Тавкавта. Мы шли по  раскаленному асфальту и голым травянистым холмам, затем зашли в лесную чащу. Мы так и не встретили других людей, но следы былого присутствия человека нам попадались: редкий мусор, следы от автомобиля, места для очага, поле, усеянное картошкой и древние каменные постройки. Из-за жары и тяжелых рюкзаков идти было сложно, но нас манила идея водопада. Мы шли четвертый час, но к нашему разочарованию дорога закончилась вершиной, на которой нас встретили свежепокрашенный красный крест, крепость и недостроенная церковь. Никакого водопада поблизости мы так и не обнаружили. Но зато там была отличная сотовая связь, которой не было большую часть пути.`,
        `К нам подошла женщина и позвала к столу, по-английски. Было неловко отказаться, мы пошли. Когда нас спросили и услышали в ответ, откуда мы, повисла неловкая пауза и ощущение дискомфорта и разочарования. Мужчина, который был главным по приему гостей, попросил меня сказать тост по-английски несмотря на то, что весь стол очевидно говорил только по-грузински и по-русски. Я пыталась говорить хорошие слова про культуру, природу и людей Грузии. Но меня не понимали. Когда я завершила тост, никто кроме меня бокал не поднял.
            (Полина)`
      ],
      eng: [],
      format: 'journals_type_b'
    },
    audioArrey: [
      "../media/audio/frame-illusion/12.ветер.mp3",
      "../media/audio/frame-illusion/ZOOM0049_LR.wav",
      "../media/audio/frame-illusion/ZOOM0050_LR.wav"
    ]
  },
  revelations: {
    images: [
      'url(../media/images/frame-revelations/IMG_2221.JPG',
      'url(../media/images/frame-revelations/IMG_2225.JPG',
      'url(../media/images/frame-revelations/IMG_6095.JPG'
    ],
    video: [
      {
        video: "./",
        image: 'url(./)',
        format: 'popup__video_type_a'
      }
    ],
    texts: {
      rus: [
        `Я трусиха. Я бесконечно люблю природу, ценю ее, пытаюсь постоянно осознавать, что я ее часть, но оставшись с ней наедине, я робею. Мне становится страшно как только приходит темнота, я боюсь хищников, я боюcь насекомых. В связке с этим, я осознала, насколько природа мощная и самостоятельная. Насколько она подвижная и адаптивная. Природа - не незабытая жертва, а забытый участник. Природа - не фон для человеческих передряг, а среда, обстоятельства и последствия.`,
        `Не могу найти хаос здесь. Видимо не так глубоко зашли, поэтому все кажется слишком гармоничным.`,
        `Чувство голода приятно, чувство жажды ужасно и пугающе.`,
        `Ощущение, что я кого-то не встретила. Кажется, что это чувство появляется при каждом походе в лес.`,
        `Открытия - всегда проверяй точку, найденную на google картах дополнительным поиском, и набирай воду в каждом встречном источнике.`,
        `Мы были внимательны к природе. Мы прислушиваись, присматривались и наблюдали. Это сказалось и на наших межличностных отношениях. Мы были очень спокойны и адаптивны, мы поддерживали, но при этом были независимы и самостоятельны.`,
        `Рокот насекомых повсюду
              Мы следуем по маршруту
              Сквозь цветения буйство`
      ],
      eng: [],
      format: 'journals_type_c'
    },
    audioArrey: [
      "../media/audio/frame-revelations/7.стрекот цикад.mp3",
      "../media/audio/frame-revelations/19.птицы.mp3"
    ]
  },
  monument: {
    images: [
      'url(../media/images/frame-monument/IMG_2089_animation.JPG',
      'url(../media/images/frame-monument/IMG_2106.JPG',
      'url(../media/images/frame-monument/IMG_2126.JPG',
      'url(../media/images/frame-monument/IMG_2144.JPG'
    ],
    video: [
      {
        video: "./",
        image: 'url(./)',
        format: 'popup__video_type_a'
      }
    ],
    texts: {
      rus: [
        `Очень жарко, горячий бетон. Сверчки. Мухи Первое видимое живое существо - ящерица, а из травы доносится рокот насекомых множество полевых цветов.
            Шоти (хлеб) под главным крестом. 43 огромных меча вонзаются в землю, в полотно кожи холма. Некоторые из них можно - раскачать. - - Больно смотреть -. Будто тело, в которое воткнуто 43 ножа.`,
        `Вокруг разбросаны бронзовые абстрактные и полу-абстрактные фигуры. Напоминают костяшки, позвонки, бедра.`,
        `Огромных масштабов монумент. Античность, величие, монументальность. Длинная лестница восходящая к вершине холма.
            Бетонная сцена, колонны, которые подпирают пустоту. На сцене –  акустика создающая эхо.
            Амфитеатр тоже как ступени, динамика линий, восхождение.
            Вокруг разбросаны бронзовые абстрактные и полу-абстрактные фигуры. Напоминают костяшки, позвонки, бедра.`,
        `Для своего проекта мы решили выбрать место, где ранее произошла большое сражение. И таким местом стал монумент, посвященный Дидгорской битве и его окрестности.
            Дидгорская битва — сражение, которое произошло 12 августа 1121 года между войсками Грузинского царства и сельджукскими войсками. Сражение привело к разгрому сельджукской армии и освобождению Тбилиси, который стал столицей страны. С этого момента начался «Золотой Век» грузинской истории. Битва широко упоминается в грузинском фольклоре и культуре.`
      ],
      eng: [],
      format: 'journals_type_a'
    },
    audioArrey: [
      "../media/audio/frame-monument/1.колокола.mp3",
      "../media/audio/frame-monument/13.стрекот цикад.mp3"
    ]
  },
  war: {
    images: [
      'url(../media/images/frame-war/IMG_2108.JPG)',
      'url(../media/images/frame-war/IMG_2127.JPG)',
      'url(../media/images/frame-war/IMG_2130.JPG)'
    ],
    video: [
      {
        video: "./",
        image: 'url(./)',
        format: 'popup__video_type_a'
      }
    ],
    texts: {
      rus: [
        `павшие воины становятся удобрением для почвы`,
        `Одно из самых разрушительных и жестоких людских проявлений – это война. И здесь природа в очередной раз оказывается на втором плане. Открытые пространства используют, как «поля битвы», леса и овраги, как укрытие. И если до ХХ века самым страшным военным орудием были огонь и пушки, последние 100 с лишним лет человечество значительно обогатило арсенал взаимного уничтожения ядерным, водородным и химическим оружием.`,
        `Вокруг разбросаны бронзовые абстрактные и полу-абстрактные фигуры. Напоминают костяшки, позвонки, бедра. Не погребенные кости воинов или коней, которым пришлось участвовать в сражении людей. Что-то в этих фигурах было инородное, другая эстетика, непонятность, абсурдность, как и суть войны/сражений.`,
        `Мужчина нарушил повисшее молчание словами, что надо выпить за нашу страну Грузию, ее культуру и историю. А потом передал слово другому мужчине, который предложил выпить за Грузию, у которой было много великих побед и будет еще..
              После этого нам намекнули, что ритуал окончен и нам можно уходить.`
      ],
      eng: [],
      format: 'journals_type_a'
    },
    audioArrey: [
      "../media/audio/frame-war/9.стрекот цикад.mp3"
    ]
  },
  person: {
    images: [
      'url(../media/images/frame-person/IMG_2115.JPG',
      'url(../media/images/frame-person/IMG_2123.JPG',
      'url(../media/images/frame-person/IMG_2132.JPG'
    ],
    video: [
      {
        video: "../media/videos/frame-person/Polina_1.mp4",
        image: 'url(../media/videos/frame-person/poster_Polina_1.jpg)',
        format: 'popup__video_type_c'
      }
    ],
    texts: {
      rus: [
        `Поход не кажется легким и тело постоянно болит, но без острой боли.`,
        `Вообще в голову затекает река и мыслей не остается.`,
        `Выставка о биоразнообразии Кавказа находится в небольшом, пыльном и темном пространстве. Невольно вспомнила этнографический музей в Петербурге. Музей окаменелостей и чучел. Оказавшись здесь я скорее чувствовала, что соприкасаюсь с историей, историей геологии, ботаники, архивных гербариев и чучел, которые сейчас все реже можно встретить в современных музеях, но не иллюстрацией биоразнообразия Кавказа.`,
        `Зачем нужны чучела животных? Экспонат репрезентирует объект, существо, которое существует в природе. Но это чучело никак не отображает реальное животное. Скорее эти чучела показывают, как люди полвека назад представляли животных, словно выкопанные из-под земли предметы быта – древние ложки и оружие. Как интересно и точно смотрелись бы кадры с фотоловушек в музее.
              Узнавание растений. Мы вырвали растения из своей привычной жизни и пришли в музей узнать, как же их на самом деле зовут. Звучит довольно кровожадно.`
      ],
      eng: [],
      format: 'journals_type_a'
    },
    audioArrey: [
      "../media/audio/frame-person/3.стук по меди статуй.mp3",
      "../media/audio/frame-person/22.вода и птички.mp3"
    ]
  },
  conflict: {
    images: [
      'url(../media/images/frame-conflict/IMG_2172.JPG)',
      'url(../media/images/frame-conflict/IMG_2175.JPG)',
      'url(../media/images/frame-conflict/IMG_2177.JPG)',
      'url(../media/images/frame-conflict/IMG_2180.JPG)'],
    video: [
      {
        video: '../media/videos/frame-conflict/fist_v2.mp4',
        image: 'url(../media/videos/frame-conflict/poster_fist_v2.jpg)',
        format: 'popup__video_type_a'
      }
    ],
    texts: {
      rus: [
        `Деревья-это не личности, это множественность. И они живут понятием “мы”, а не “я”. Таким образом и конфликт перестает быть “личным”.`,
        `Кажется, гармония построена в том числе на мелких конфликтах. Сосуществование, наверное, невозможно без конфликтов? Развитие, возможно не будет происходить без них? Борьба за солнце, за еду, за лучшее местечко в лесу. Но эти конфликты не переходят границы реальных потребностей. И нередко, один осознав свое бессилие, безропотно отступает.
              Конфликты неминуемы. Они происходят постоянно, на микроуровне, изредка переходя в макро.`,
        `Вьюн вьется вокруг дерева. Дерево не убегает, оно подчиняется. Умирая они продолжают сосуществовать. Дерево умирает “в объятиях” вьюна.`,
        `Конфликт естественен. Возможен ли баланс в конфликте? Конфликт – это убийство и соперничество или это подавление чужих интересов? Конфликт – это насилие. Природа невозможна без насилия.
              Сильный убивает слабого – закон сформированный природой. Но сформулировал его человек. Возможна ли свобода в природе или все подчиненно строгим законам? Может быть, при отклонении от этого закона возникает конфликт?
              Конфликт и гармония противоположны или могут сосуществовать?
              Конфликт оставляет след, память.`,
        `Природа и конфликт - тот факт, что мы играли в “Морской бой” на третий день. Думаю, что конфликт это основа бытия. Борьба света и тьмы, как концепция и в целом противостояние, как состояние. Этот мир не может пребывать в абсолютной безмятежности. Даже, если в нем все спокойно с точки зрения событий, контраст/конфликт будет в цвете, свете, композиции или звуке. Эта “сильная доля” все равно будет возникать. И, кстати, я выиграла в “Морской бой”. Но надо отдать должное - я же и предложила в него играть.`
      ],
      eng: [],
      format: 'journals_type_a'
    },
    audioArrey: [
      '../media/audio/frame-conflict/5.стрекот цикад.mp3',
      '../media/audio/frame-conflict/11.ветер и мухи.mp3'
    ]
  },
  movement: {
    images: [
      'url(./'
    ],
    video: [
      {
        video: "../media/videos/frame-movement/dancing_stone.mp4",
        image: 'url(../media/videos/frame-movement/poster_dancing_stone.jpg)',
        format: 'popup__video_type_a'
      }, {
        video: "../media/videos/frame-movement/DSCF0823_30sec.mp4",
        image: 'url(../media/videos/frame-movement/poster_DSCF0823_30sec.jpg)',
        format: 'popup__video_type_a'
      }, {
        video: "../media/videos/frame-movement/MVI_5637.MOV",
        image: 'url(../media/videos/frame-movement/poster_MVI_5637.jpg)',
        format: 'popup__video_type_c'
      }, {
        video: "../media/videos/frame-movement/Polina_2v2.mp4",
        image: 'url(../media/videos/frame-movement/poster_Polina_2v2.jpg)',
        format: 'popup__video_type_c'
      }
    ],
    texts: {
      rus: [
        `Природа владеет невероятным балансом, вестибулярным аппаратом, подвижностью, адаптивностью. Так как она расслаблена и состоит из множества разрозненных элементов.`,
        `Это как в танце - если быть напряженным, и стоять колом, ты очень неустойчив. Если иметь мягкое тело, подвижность, адаптивность, а еще лучше танцевать не “против”, а “вместе” с полом, стульями, людьми вокруг, стенами или землей, деревьями, водой, танец может быть бесконечным и ошеломляюще красивым...`,
        `Утро тумана. На горы сверху спускается густой туман. Только один раз увидела сквозь облака белый круг солнца. Птицы с раннего утра заняты своими делами - кто-то летит по долине между холмов, кто-то парит в небе, кто-то бегал по камню как ящерица, кто-то стучит по дереву.`,
        `Для меня самый понятный, натуральный способ общения/взаимодействия с природой - это движение: бегать, танцевать, лежать, ползать, подражать, повторять линии, повторять движения, повторять характер.`,
        `Вода в разных фазах реки падает с разным звуком и ритмом.`
      ],
      eng: [],
      format: 'journals_type_a'
    },
    audioArrey: [
      "../media/audio/frame-movement/16.журчание воды.mp3",
      "../media/audio/frame-movement/23.речка бежит.mp3",
      "../media/audio/frame-movement/25.речка бежит.mp3"
    ]
  },
  time: {
    images: [
      'url(../media/images/frame-time/IMG_6848.JPG'
    ],
    video: [
      {
        video: "../media/videos/frame-time/fog.mp4",
        image: 'url(../media/videos/frame-time/poster_fog.jpg)',
        format: 'popup__video_type_b'
      }, {
        video: "../media/videos/frame-time/timelapse.mp4",
        image: 'url(../media/videos/frame-time/poster_timelapse.jpg)',
        format: 'popup__video_type_c'
      }
    ],
    texts: {
      rus: [
        `Поразил Petrified wood - Окаменелое дерево. Сколько ему веков? Минеральная мумификация дерева..Растительный мир был представлен гербарием, образцы которого датировались начиная с конца 19 века. Пожелтевшая бумага и потерявшие почти весь пигмент цветы. Сравнивая с фотографией, мы с трудом узнавали образцы. Интересно, как эти засохшие цветы в рамочке могут помочь людям познакомиться с био многообразием?`,
        `"Древесное время цикличное, периодически повторяющееся, многолетнее; прошлое и будущее дышат одновременно, и настоящее совершенно необязательно течет в одном направлении; наоборот, оно чертит круги внутри кругов, похожих на древесные кольца – те, что вы видите, срубив дерево. Древесное время эквивалентно времени рассказанной истории, и, как все истории, оно не развивается по идеальной прямой, безупречной кривой или под правильным углом, но изгибается и разветвляется, принимая фантастические формы, порождая чудесные ответвления и потрясающие воображение дуги. Человеческое время и древесное время – понятия несовместимые."`,
        `Нужно отойти от линейности событий. Для природы прошлое, настоящее и будущее едины.`,
        `Природа представляет из себя мудро устроенную экосистему в которой все подчиняется строго определенной логике. Один из таких законов - всё когда-то родившееся, однажды умирает и отдает свою последнюю честь земле, запуская новый цикл жизни для других существ. Антропогенное воздействие внесло свои коррективы во многие ранее устоявшиеся природные традиции, но закон жизни и смерти актуален, как и раньше.`
      ],
      eng: [],
      format: 'journals_type_a'
    },
    audioArrey: [
      "../media/audio/frame-time/6.стрекот цикад.mp3"
    ]
  }
};

export { source };
